src/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Comment>на доставку</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосетителей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Comment>с учетом всех скидок (сумма к оплате)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактнаяИнформация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактнаяИнформация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интернет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АгентыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПосадочноеМесто</Name>
					<Comment>для совместимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомер</Name>
					<Comment>для заказов загруженных из внешней базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрактиръМобайл</Name>
					<Comment>признак синхронизации с ТрактиръМобайл</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдТрактиръМобайл</Name>
					<Comment>внутренний ид на сервере ТрактиръМобайл</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подарок</Name>
							<Comment>если позиция добавлена автоматически при расчете скидок</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТовара</Name>
							<Comment>для связи с товарами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специфика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиСпецифики</Name>
							<Comment>для вложенных специфик</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартнерыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЗаказДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаказДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАвторизации</Name>
					<Comment>дата/время регистрации карты лояльности в заказе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Заявка/Forms/ФормаСписка/module.bsl
Перем ТаблицаЗаказов;

// Процедура обновляет статусы заказов, изменяет картинку статуса
// 
Процедура ОбновитьСтатусыЗаказов(ОформленияСтрок)
	
	Запрос = ПолучитьСписокДинамическогоПоля(ЭлементыФормы.ДокументСписок);
	Запрос.Выполнить();
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказДопИнф.Заказ,
	|	ЗаказДопИнф.Статус
	|ИЗ
	|	РегистрСведений.ЗаказДопИнф КАК ЗаказДопИнф
	|ГДЕ
	|	ЗаказДопИнф.Заказ В
	|			(ВЫБРАТЬ
	|				Заказы.Ссылка КАК Заказ
	|			ИЗ
	|				Заказы КАК Заказы)";
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		Заказ = ОформлениеСтроки.ДанныеСтроки.Ссылка;
		Разница = Заказ.Товары.Итог("СуммаРеализации") - Заказ.Товары.Итог("Сумма");
		Если Разница < 0 Тогда
			ОформлениеСтроки.Ячейки.Скидка.ОтображатьКартинку = Истина;
			ОформлениеСтроки.Ячейки.Скидка.ИндексКартинки = 3;
		ИначеЕсли Разница > 0 Тогда
			ОформлениеСтроки.Ячейки.Скидка.ОтображатьКартинку = Истина;
			ОформлениеСтроки.Ячейки.Скидка.ИндексКартинки = 4;
		КонецЕсли;
		
		СтрокаЗаказа = ТаблицаЗаказов.Найти(Заказ, "Заказ");
		Если НЕ СтрокаЗаказа = Неопределено Тогда
			Если СтрокаЗаказа.Статус = Перечисления.СтатусыЗаказа.Закрыт Тогда
				
				ОтборПротокол 			= Новый Структура("Заказ", СтрокаЗаказа.Заказ);
				ЗаписиРегистра 	= РегистрыСведений.ЗаказДопИнф.Получить(ОтборПротокол);
				
				ОформлениеСтроки.Ячейки.Статус.ОтображатьКартинку = Истина;

				Если ЗаписиРегистра.ПротоколРасчетов.ККМ = Справочники.ТорговоеОборудование.ПустаяСсылка() И
					НЕ ЗаписиРегистра.ПротоколРасчетов.Неучетный Тогда
					ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = 5;
				Иначе
					ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = 0;
				КонецЕсли;
				
			ИначеЕсли СтрокаЗаказа.Статус = Перечисления.СтатусыЗаказа.Удален Тогда
				ОформлениеСтроки.Ячейки.Статус.ОтображатьКартинку = Истина;
				ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ОбновитьСтатусыЗаказов()

// ---------------------------- взято с itland.ru (немного изменено) -----------------------------
// Функция предназначена для получения таблицы с содержимым текущего динамического списка
// Параметры:
//	тпДинСписок - элемент формы, отображающий динамический список
// Возвращаемое значение:
//	Объект типа "Запрос" с установленными параметрами, но не выполненный :)
// В случае ошибки возвращается Неопределено
Функция ПолучитьСписокДинамическогоПоля(тпДинСписок)
	// определим нужные переменные
	ствУсловия = Новый Соответствие;
	ствУсловия.Вставить(ВидСравнения.Больше, "П > &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.БольшеИлиРавно, "П >= &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.ВИерархии, "П В ИЕРАРХИИ (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.ВСписке, "П В (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.ВСпискеПоИерархии, "П В ИЕРАРХИИ (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.Интервал, "Д > &ПАРАМЕТР1 И ПАРАМЕТР < &ПАРАМЕТР2");
	ствУсловия.Вставить(ВидСравнения.ИнтервалВключаяГраницы, "Д >= &ПАРАМЕТР1 И ПАРАМЕТР <= &ПАРАМЕТР2");
	ствУсловия.Вставить(ВидСравнения.ИнтервалВключаяНачало, "Д >= &ПАРАМЕТР1 И ПАРАМЕТР < &ПАРАМЕТР2");
	ствУсловия.Вставить(ВидСравнения.ИнтервалВключаяНачало, "Д > &ПАРАМЕТР1 И ПАРАМЕТР <= &ПАРАМЕТР2");
	ствУсловия.Вставить(ВидСравнения.Меньше, "П < &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.МеньшеИлиРавно, "П <= &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.НеВИерархии, "П НЕ В ИЕРАРХИИ (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.НеВСписке, "П НЕ В (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.НеВСпискеПоИерархии, "П НЕ В ИЕРАРХИИ (&ПАРАМЕТР)");
	ствУсловия.Вставить(ВидСравнения.НеРавно, "П <> &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.Равно, "П = &ПАРАМЕТР");
	ствУсловия.Вставить(ВидСравнения.Содержит, "С ПОДОБНО &ПАРАМЕТР");
	// начнем делать запрос
	Запрос = Новый Запрос;
	// СофтБаланс начало
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	// СофтБаланс Окончание
	стрТекстЗапроса = "ВЫБРАТЬ";
	стрРазделитель = "";
	// получим перечень видимых полей
	стрТекстЗапроса = стрТекстЗапроса+стрРазделитель+" идз.Ссылка КАК Ссылка";
	стрРазделитель = ", ";
	Для каждого Элемент из тпДинСписок.Колонки Цикл
		Если Элемент.Видимость и не ПустаяСтрока(Элемент.Данные) Тогда
			стрТекстЗапроса = стрТекстЗапроса+стрРазделитель+" идз."+Элемент.Данные+" КАК "+Элемент.Данные;
			стрРазделитель = ", ";
		КонецЕсли;
	КонецЦикла;
	Если стрРазделитель = "" Тогда
		// нет полей в запросе, тогда просто подставим *
		стрТекстЗапроса = стрТекстЗапроса+"*";
	КонецЕсли;
	// определим, из какой таблицы делать запрос
	мдОбъект = Метаданные.НайтиПоТипу(ТипЗнч(тпДинСписок.Значение));
	стрИмяТаблицы = мдОбъект.ПолноеИмя();
	Если Метаданные.РегистрыСведений.Содержит(мдОбъект) Тогда
		Если тпДинСписок.ВыбиратьСрез = ИспользованиеСреза.Первые Тогда
			стрИмяТаблицы = стрИмяТаблицы + ".СрезПервых(&ПериодСрезаПериодическогоРегистраСведений)";
			Запрос.УстановитьПараметр("ПериодСрезаПериодическогоРегистраСведений", тпДинСписок.СтандартныйПериод.ДатаНачала);
		ИначеЕсли тпДинСписок.ВыбиратьСрез = ИспользованиеСреза.Последние Тогда
			стрИмяТаблицы = стрИмяТаблицы + ".СрезПоследних(&ПериодСрезаПериодическогоРегистраСведений)";
			Запрос.УстановитьПараметр("ПериодСрезаПериодическогоРегистраСведений", тпДинСписок.СтандартныйПериод.ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
	
	// СофтБаланс начало
	стрТекстЗапроса = стрТекстЗапроса + " ПОМЕСТИТЬ Заказы ";
	// СофтБаланс окончание
	
	стрТекстЗапроса = стрТекстЗапроса+Символы.ПС+"ИЗ "+стрИмяТаблицы+" КАК идз";
	// сформируем условия
	Если тпДинСписок.Значение.Отбор <> Неопределено Тогда
		стрГДЕ = Символы.ПС+"ГДЕ ";
		стрРазделитель = "";
		Для каждого Элемент из тпДинСписок.Значение.Отбор Цикл
			Если Элемент.Использование Тогда
				сРежимПараметров = Лев(ствУсловия[Элемент.ВидСравнения], 1);
				стрУсловие = Элемент.ПутьКДанным+" "+стрЗаменить(Сред(ствУсловия[Элемент.ВидСравнения], 2), "ПАРАМЕТР", Элемент.ПутьКДанным);
				Если сРежимПараметров = "П" Тогда // одиночный параметр или список
					Запрос.УстановитьПараметр(Элемент.ПутьКДанным, Элемент.Значение);
				ИначеЕсли сРежимПараметров = "Д" Тогда // два параметра
					Запрос.УстановитьПараметр(Элемент.ПутьКДанным+"1", Элемент.ЗначениеС);
					Запрос.УстановитьПараметр(Элемент.ПутьКДанным+"2", Элемент.ЗначениеПо);
				ИначеЕсли сРежимПараметров = "С" Тогда // строка (условие ПОДОБНО)
					Запрос.УстановитьПараметр(Элемент.ПутьКДанным, "%"+Элемент.Значение+"%");
				КонецЕсли;
				стрТекстЗапроса = стрТекстЗапроса+стрГДЕ+стрРазделитель+стрУсловие;
				стрРазделитель = " И ";
				стрГДЕ = "";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = стрТекстЗапроса;
	Возврат Запрос;
КонецФункции // ПолучитьСписок()

//Процедура-обработчик события ПриПолученииДанных списка.
//
Процедура ДокументСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	ОбновитьСтатусыЗаказов(ОформленияСтрок);
КонецПроцедуры

//Процедура-обработчик события ПриАктивизацииСтроки списка.
//
Процедура ДокументСписокПриАктивизацииСтроки(Элемент)
	
	ИнтерфейсАдмина.СоздатьСписокПечатныхФорм(ЭтаФорма);
	
КонецПроцедуры

// Процедура назначается динамически
// Процедура вызывается при выборе пункта подменю "Печать" командной панели
// формы. Процедура отрабатывает выбор печатной формы.
// Подключение данной процедуры-обработчика выполняется из кода конфигурации
//
Процедура ДействияФормыДействиеВыбратьПечатнуюФормы(Кнопка) 
	
	ИнтерфейсАдмина.ВыбратьПечатнуюФорму(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ДокументСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Попытка
		ОформлениеСтроки.Ячейки.ПосадочноеМесто.Текст = НаимПосадочногоМеста(ДанныеСтроки.ПосадочноеМесто);
	Исключение	
	КонецПопытки;	
КонецПроцедуры
